XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Toshiba.TXZ4Aplus-M4K2_DFP.pdsc
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter A (ADC)"/>
          <feature type="ADC"           n="3"      m="12"               name="Analog to Digital Converter B (ADC)"/>
          <feature type="ADC"           n="3"      m="12"               name="Analog to Digital Converter C (ADC)"/>

          <feature type="CoreOther"     n="1"                           name="Advanced Vector Engine Plus (A-VE+)xxxxxxxxxxxxxxxxxxx"/>
          <feature type="CoreOther"     n="3"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>

          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>

          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="105"/>
          <feature type="QFP"           n="64"                         name="P-LQFP64-1010-0.50-003"/>
        </device>

        <!-- *************************9*************LFYAF*L=64P 256****************************************************** -->
        <!-- ***********************  Device 'TMPM4KLFYAFG'  ************************* -->
        <device Dname="TMPM4KLFYAFG">
          <processor Dclock="160000000"/>
          <compile header="Device/Include/TMPM4KLA.h" define="TMPM4KLA"/>
          <debug svd="SVD/M4KLA.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Kx_code_256.FLM" start="0x00000000" size="0x00040000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Kx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <feature type="IOs"           n="51"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="15"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="15"                          name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="30"                          name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>

          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit Version A(EI2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>

          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter A (ADC)"/>
          <feature type="ADC"           n="3"      m="12"               name="Analog to Digital Converter B (ADC)"/>
          <feature type="ADC"           n="3"      m="12"               name="Analog to Digital Converter C (ADC)"/>

          <feature type="CoreOther"     n="1"                           name="Advanced Vector Engine Plus (A-VE+)xxxxxxxxxxxxxxxxxxx"/>
          <feature type="CoreOther"     n="3"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>

          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>

          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="105"/>
          <feature type="QFP"           n="64"                         name="P-LQFP64-1414-0.8-002"/>
          <!--book name=""/-->

        </device>
        <!-- ********************************************************************************************* -->

        <!-- *************************10*************LFWAF*L=64P 128****************************************************** -->
        <!-- ***********************  Device 'TMPM4KLFWAFG'  ************************* -->
        <device Dname="TMPM4KLFWAFG">
          <processor Dclock="160000000"/>
          <compile header="Device/Include/TMPM4KLA.h" define="TMPM4KLA"/>
          <debug svd="SVD/M4KLA.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM4Kx_code_128.FLM" start="0x00000000" size="0x00020000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>
          <algorithm name="Flash/TMPM4Kx_data_32.FLM"  start="0x30000000" size="0x00008000"  RAMstart="0x20000000"  RAMsize="0x2000"  default="1"/>

          <feature type="IOs"           n="51"                          name="I/O Ports (PORT)"/>
          <feature type="ExtInt"        n="15"                          name="External interrupt (INT)"/>
          <feature type="CoreOther"     n="15"                          name="Digital Noise Filter (DNF)"/>
          <feature type="DMA"           n="30"                          name="Direct Memory Access Controllor (DMAC)"/>
          <feature type="Timer"         n="6"      m="32"               name="32bit Timer Event counter (T32A)"/>

          <feature type="UART"          n="3"                           name="Universal Asynchronous Receiver Transmitter (UART)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit (I2C)"/>
          <feature type="I2C"           n="2"                           name="Inter-Integrated Circuit Version A(EI2C)"/>
          <feature type="SPI"           n="2"                           name="Toshiba Serial Peripheral Interface (TSPI/SIO)"/>

