XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Toshiba.TXZ4Aplus-M4K2_DFP.pdsc
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter A (ADC)"/>
          <feature type="ADC"           n="3"      m="12"               name="Analog to Digital Converter B (ADC)"/>
          <feature type="ADC"           n="3"      m="12"               name="Analog to Digital Converter C (ADC)"/>

          <feature type="CoreOther"     n="1"                           name="Advanced Vector Engine Plus (A-VE+)xxxxxxxxxxxxxxxxxxx"/>
          <feature type="CoreOther"     n="3"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>

          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>

          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="105"/>
          <feature type="QFP"           n="44"                              name="P-LQFP44-1010-0.8xxxxxxxxxxx"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="TMPM4KYA Compiler">
      <accept condition="Compiler ARMCC"/>
      <accept condition="Compiler IAR"/>
    </condition>

    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM4KNx CMSIS">
      <description>Toshiba TMPM4KNx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4KN*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4KMx CMSIS">
      <description>Toshiba TMPM4KMx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4KM*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4KLx CMSIS">
      <description>Toshiba TMPM4KLx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4KL*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4KHx CMSIS">
      <description>Toshiba TMPM4KHx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4KH*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>

    <!-- Startup TMPM4KNx -->
    <!-- Startup TMPM4KNx N=100P -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4KNx CMSIS">
      <description>System Startup for Toshiba TMPM4KNx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4KYA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4KNA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4KNA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4KyA.c"      attr="config" version="1.0.0" condition="TMPM4KYA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4KMx -->
    <!-- Startup TMPM4KMx M=80P -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4KMx CMSIS">
      <description>System Startup for Toshiba TMPM4KMx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4KYA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4KMA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4KMA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4KyA.c"      attr="config" version="1.0.0" condition="TMPM4KYA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4KLx -->
    <!-- Startup TMPM4KLx L=64P -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4KLx CMSIS">
      <description>System Startup for Toshiba TMPM4KLx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4KYA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4KLA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4KLA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4KyA.c"      attr="config" version="1.0.0" condition="TMPM4KYA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4KHx -->
    <!-- Startup TMPM4KHx H=44P -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4KHx CMSIS">
      <description>System Startup for Toshiba TMPM4KHx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4KYA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4KHA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4KHA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4KyA.c"      attr="config" version="1.0.0" condition="TMPM4KYA Compiler"/>
      </files>
    </component>

  </components>

</package>
